console.log(`          Невыполненные пункты

Модальное окно MY PROFILE

1)Счетчик для Books отображает, сколько у пользователя книг находятся в состоянии Own. Значение варьируется 0-16. -2

Блок Favorites

1)При нажатии на любую кнопку Buy, после покупки абонемента, меняет вид кнопки на неактивную Own, добавляя единицу к счетчику книг в профиле. -2
2)Кроме того после нажатия обновляется не только счетчик, но и название книги должно отобразится в разделе Rented Books. Название формируется по принципу <название книги>, <автор книги>. В случае если название книги слишком длинное или список стал слишком большой список книг в блоке Rented Books становится скроллируемым (по необходимости горизонтально/ вертикально или оба скролла сразу) Тайтл Rented Books скроллироваться не должен -2

Модальное окно BUY A LIBRARY CARD

1)Для того, чтобы кнопка Buy была активна, все поля должны быть не пустыми. -2
2)Bank card number должен содержать 16 цифр. С пробелами каждые 4 символа или нет - значения не имеет. -2
3)Expiration code содержит 2 поля с ограничением в 2 цифры. -2
4)CVC должен содержать 3 цифры. -2
5)После удачного нажатия на кнопку Buy, окно закрывается, и больше мы к нему не возвращаемся.

Итого 186/200
`)